// Напишите программу, которая принимает на вход 
// пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine("Введите пятизначное число:");
Convert.ToInt32(Console.ReadLine());
int num =1 ;
int i = 1;


 while(num > 0)
     if("i>0;(num%10)/10; i++");
      

 else Console.WriteLine("Нет, не является палиндромом");

    



Console.WriteLine($"{num} -> нет");
