// Задача 25: Напишите цикл, который принимает на вход два числа (A и B)
//  и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

Console.WriteLine("Введите число А : ");
int num = Convert.ToInt32( Console.ReadLine());
int result =1;
int num A =1
Console.WriteLine("Введите число А : ");
int num = Convert.ToInt32( Console.ReadLine());
  int sqr =0;
  for (int i =1; i >numB;i++);
  result = result* num

}


int result = Sqrt
Console.WriteLine($"Степень числа {}")
